package quiz_3;

public class quiz1 {

	
/*
		 * 1. 다음 아래 메서드를 모두 생성하고 호출해보세요.
		 
		
		2. Person 클래스에 이름(String)과 나이(int)를 맴버변수로 가지고, 이를 출력하는 info() 메서드를 생성 후, PersonMain 클래스에서 info()메서드를 실행하세요.
		
		3. 이름(name), 국어(kor), 영어(eng), 수학(mat) 점수를 입력받아서 총점(tot), 평균(avg)을 구하는
		프로그램을 작성하세요. (메소드 이용할 것)
		이때 평균은 소수점 3째 자리에서 반올림해서 소수점 2째 자리까지 출력한다.
		HINT : Math.round(num * 100) / 100.0; //소수점 3번째자리에서 반올림
		
		4. 문자열을 입력받아서 문자열이 "www"로 시작하는 지를 검사하는 프로그램을 작성해보자.
		www로 시작할 경우 (문자열 + "은 'www'로 시작합니다.")를 출력
		www로 시작하지 않을 경우 (문자열 " 은'www'로 시작하지 않습니다.")를 출력
		사용자가 "quit"를 입력하면 프로그램을 종료한다.
		HINT : 문자열 자르기 : Substring(인덱스 번호, 인덱스 번호)
		문자열 비교 : Equal() 이용
 * 
 * */
	
	
	
}
